app/views/meals/index.html.erb

SELECT "meals".* FROM "meals"   ORDER BY meals.created_at DESC
SELECT COUNT(*) FROM "meals"
---

<h4>You've got <%= pluralize(@meals.size, 'meal')%> logged!</h4>