app/controllers/meals_controller.rb

  def create
    @meal = Meal.new(meal_params)

    respond_to do |format|
      if @meal.save
---
INSERT INTO "meals" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-30 14:34:26.322537"], ["description", "test"], ["name", "test"], ["updated_at", "2014-05-30 14:34:26.322537"]]

  def update
    respond_to do |format|
      if @meal.update(meal_params)
---
UPDATE "meals" SET "description" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "name" = ?, "updated_at" = ? WHERE "meals"."id" = 2

  def destroy
    @meal.destroy
---
DELETE FROM "meals" WHERE "meals"."id" = ?  [["id", 1]]

    def set_meal
      @meal = Meal.find(params[:id])
---
SELECT "meals".* FROM "meals"  WHERE (strftime('%Y', date) = ''2014'' AND strftime('%m', date) = ''05'' AND strftime('%d', date) = ''30'')